<?php
$text = 'В России
См. также: Русский свадебный обряд, Казачья свадьба и Свадебные обычаи башкир
В современной России свадьба обычно совпадает с государственной регистрацией брака. Если совершается обряд венчания, то он возможен только при наличии свидетельства о регистрации брака из государственных органов. В то же время свадьба — это больше, чем просто бракосочетание, это ещё и цикл знаменательных обрядов (в русской свадьбе: свадебный поезд, свадебный пир, выкуп невесты и тому подобное). В наши дни в России свадьба впитала в себя обычаи многих народов, однако для неё также остались характерны и самобытные обряды.

Со временем появляются новые традиции. Так, например, появилась традиция первого танца молодожёнов. Музыкальную композицию для своего первого танца молодожёны либо выбирают сами, либо танцуют под песню, предложенную ведущим. Многие пары готовятся к танцу заранее.

Белорусская свадьба
Подробнее по этой теме см.: Белорусская свадьба

Альфред Ковальский-Веруш «Свадебный санный поезд». Западная Белоруссия, конец XIX века.
Белорусская народная свадьба (белор. Вяселле), как обычай, имеет много общего со свадьбами других славянских народов. Всё начинается со сватовства. Родные жениха посылали сватов к родителям невесты с просьбой выйти замуж. Далее, спустя одну-две недели после сватовства, следовали смотрины: родители невесты осматривали хату и хозяйство родителей жениха, ибо туда после замужества отправится дочь. Накануне свадьбы у невесты устраивали девичник: приходили её подруги, родня, невесту наряжали, заплетали ей косу, плели венки и пели песни. Далее ещё один из этапов свадебного действа — посад, во время которого жениха и невесту сажали на дежу, покрытую кожухом (символ достатка), невесте прижигали волосы свечой. Наконец, за невестой приезжали друзья жениха, начинался праздничный обед в доме невесты, делёж каравая и одаривание молодых. После всего этого свадебный поезд со сватами и дружками отправлялся в дом жениха. Там начиналось застолье. Празднование свадьбы сопровождалось величанием молодых, песнями, драматизированными сценками, танцами, шутками. Собственно свадьба кончалась обрядом «сладкой водки» — восславлением молодой, сберегшей девичью честь. Обряд проходил в доме жениха после брачной ночи. Устраивая застолье, в честь молодой подслащали водку мёдом, славили невестину родню. Через неделю после свадьбы молодые навещали родителей невесты. Это называлось перезвы.

Греческая свадьба

Свадьба в Афинах. Луи Дюпре
Первыми из греческих свадебных обрядов является сватовство. Сваты выбираются из числа родственников или друзей. Главный вопрос при сватовстве — приданое (из чего оно будет состоять — одежда, утварь или другие более серьёзные вещи, такие как недвижимость).

Сами свадебные торжества могут проходить не один день и могут повторяться через некоторое время снова (например, через месяц), и проходят они преимущественно в доме невесты.

Характерная черта одеяния греческой невесты : голову украшают золотыми нитями, а лицо закрывают длинной розовой вуалью.

Важным моментом свадебного обряда считается вступление молодой жены в дом мужа. Каждое место, куда попадает новобрачная (двор, порог, дверной косяк, подножие лестницы, верхняя ступень лестницы) отмечаются особыми действиями её самой и прочих участников церемонии. Например, свекровь встречает её с хлебом и поясом, которые кладёт на порог. Молодая должна перешагнуть через них: если перешагивает правой ногой — это хорошая примета, левой — плохая. Перед входом в дом невеста трижды низко кланяется. Она рисует мёдом или маслом крестики на дверном косяке или на потолке, либо участники процессии вырезают их своими кинжалами[8].

На большое мероприятие в день венчания все собираются в доме молодого мужа.

Испания
Испанская свадьба полна красочными обрядами и многовековыми традициями. Венчание проходит в церкви по католическому обряду и является правомочным, как и брак, заключённый в муниципалитете. Обычно женщина не берёт фамилию мужа, отчего дети после рождения получают двойную фамилию родителей.

Перед венчанием молодые должны посетить «школу для женихов и невест» при церкви, где даётся информация о важности семьи в глазах церкви. После окончания школы будущие супруги получают сертификат, дающий право на венчание.

В солнечной Испании в наряде или букете невесты должен присутствовать оранжевый цвет. В этой стране верят, что цвет обязательно привлечёт удачу и страсть в заключенный брак. Интересно, что месяц май пользуется совершенно противоположной славой, нежели в России. Если наша молва испокон веков угрожает майским новобрачным «маяньем», то в Испании этот месяц – счастливейший для заключения брака.

Крымскотатарская свадьба
Одним из самых торжественных обрядов у крымцев[9][10] была свадьба, так как придавали и продолжают придавать особо важное значение прочности семьи и стремились утвердить её с помощью устоявшихся традиций. Считалось, что мужчина готов создать семью в возрасте 25 лет. К этому времени он должен был приобрести специальность, позволяющую содержать будущую семью, иметь свою «отдельную дверь» в доме отца и располагать некоторым материальным достатком. Инициатива выбора принадлежала мужчине, но последнее слово было за девушкой и её родителями. Перед получением согласия родители выясняют не пересекаются ли их предки до седьмого колена, причём в горно-лесной части Крыма разрешался выбор невесты из одного селения, а в степной части только из другого. Затем происходили и помолвка с обменом подарков и, наконец никах (венчание), свадьба. Свадьбу обязательно в пятницу играют у невесты без присутствия жениха, а в субботу невесту с приданым в сопровождении родственников перевозят в дом жениха и свадьба продолжается на стороне жениха. После брачной ночи невеста выходила к родителям мужа, целовала им руки и угощала всех привезённым с собой кофе[11].

Северная Македония
См. также: Галичницкая свадьба
Украинская свадьба

Н. К. Пимоненко. «Свадьба в Киевской губернии», 1891
Подробнее по этой теме см. Украинские свадебные обряды.
Современная свадьба на Украине (укр. весілля) приравнивается к регистрации брака в ЗАГСе. Если совершается обряд венчания, то он возможен только при наличии свидетельства о регистрации брака из государственных органов. В особенностях проведения свадьбы перемешались языческие, православные, народные и более современные обряды[12]. Также на структуру дня свадьбы наложило свой отпечаток советское прошлое. В последнее время стали популярными свадьбы в украинском стиле. При этом жених и невеста иногда одеваются в этнические свадебные наряды, используют в оформлении свадьбы элементы, придающие национальный колорит (свадебный рушник).

В Азии и на Востоке
Казахская свадьба
Основные статьи: Казахская свадьба и Казахские свадебные обряды
Израиль
Подробнее по этой теме см. Брак в иудаизме.

Еврейская свадьба
Свадьба в Израиле — исключительно религиозный обряд[13]. Свадьбу между евреями проводит раввин (он же выдаёт брачное свидетельство), между мусульманами — мулла, между христианами — священник. Государство только регистрирует (после церемонии) факт выдачи брачного свидетельства. Обязательной такая регистрация не является.

Для евреев необходимым и достаточным условием вступления в брак является дарение невесте женихом кольца и произнесения фразы: «Ты посвящена мне по Закону Моисея». Если при этом присутствовали два свидетеля, такая пара считается мужем и женой. В то же время не обходится без курьёзов: в начале 2000-х годов ученик старших классов одной из израильских школ формально выполнил обряд бракосочетания со своей приятельницей — подарил ей кольцо в присутствии свидетелей; в результате, после разрыва отношений эта пара была вынуждена разводиться.

Еврейским мужчинам из рода Коэнов (Коганов, Кагановичей и т. д.) запрещено вступать в брак с разведённой женщиной, с вдовой или с женщиной, принявшей гиюр. Также существует запрет на брак с женщиной, рождённой от запретного для её отца брака или с женщиной, имеющей запрещённые связи вне брака.

Смешанные браки в Израиле в данный момент не регистрируются. Также не регистрируются нерелигиозные браки. Представителям различных религиозных верований или атеистам, желающим вступить в брак, приходится выезжать за рубеж либо фактически (ехать за границу) либо формально (в одном из иностранных посольств). Израиль признаёт браки, заключённые за границей.

С государственной точки зрения, если мужчина с женщиной живут несколько лет вместе и ведут общее хозяйство, то они считаются мужем и женой со всеми вытекающими из этого имущественными правами и обязанностями на основании закона о незарегистрированных партнёрствах.

С 1994 года Израиль распространил закон о незарегистрированных партнёрствах на однополые браки, а в 2006 году Верховный суд Израиля обязал правительство признать заключённые за границей однополые браки.


Индийский жених приезжает на церемонию на коне. Раджпуты
Индия
Церемония обычно полностью или хотя бы частично проходит на санскрите, языке индийских священных писаний. Свадебные празднования могут длиться до нескольких дней и очень отличаются в зависимости от региона, деноминации и касты. В день свадьбы жених и невеста надевают на шею друг другу ритуальный венок. Большинство гостей присутствуют только на этой части церемонии, и затем — после трапезы и общения — удаляются. Религиозная часть свадьбы начинается через несколько часов в присутствии близких друзей и родственников. Брамин (индуистский священник) зажигает священный огонь Агни, который призывается высшим свидетелем заключения брака. Священник читает мантры, затем жених и невеста семь раз обходят вокруг священного огня, взявшись за руки. После того как жених надевает на шею невесты золотую подвеску и ставит символический знак (синдур) на её лбу, невеста считается его женой и частью его семьи, и связанной с';

if($wordsCount = substr_count($text,'свадьба')) {
    echo $wordsCount;
}
?>
